"""
79. 单词搜索
难度
中等

406

收藏

分享
切换为英文
关注
反馈
给定一个二维网格和一个单词，找出该单词是否存在于网格中。

单词必须按照字母顺序，通过相邻的单元格内的字母构成，其中“相邻”单元格是那些水平相邻或垂直相邻的单元格。同一个单元格内的字母不允许被重复使用。



示例:

board =
[
  ['A','B','C','E'],
  ['S','F','C','S'],
  ['A','D','E','E']
]

给定 word = "ABCCED", 返回 true
给定 word = "SEE", 返回 true
给定 word = "ABCB", 返回 false


提示：

board 和 word 中只包含大写和小写英文字母。
1 <= board.length <= 200
1 <= board[i].length <= 200
1 <= word.length <= 10^3

"""
"""
from typing import List, Tuple
import copy


class Solution:
    def exist(self, board: List[List[str]], word: str) -> bool:
        if not str:
            return False

        lenY = len(board)
        lenX = len(board[0])

        stateList = [[False for _ in range(lenX)] for _ in range(lenY)]

        def __exist(board: List[List[str]], curPosition: Tuple[int, int], direct: Tuple[int, int], word: str,
                    stateList: List[List[bool]]) -> bool:
            if not word:
                return True

            newX = curPosition[0] + direct[0]
            newY = curPosition[1] + direct[1]

            if newX > lenX - 1 or newY > lenY - 1 or newX < 0 or newY < 0:
                return False

            if (not stateList[newY][newX]) and word[0] == board[newY][newX]:
                # stateList1 = copy.deepcopy(stateList)
                stateList[newY][newX] = True
                stateList1 = stateList
                if __exist(board, (newX, newY), (1, 0), word[1:], copy.deepcopy(stateList1)) or \
                        __exist(board, (newX, newY), (-1, 0), word[1:], copy.deepcopy(stateList1)) or \
                        __exist(board, (newX, newY), (0, 1), word[1:], copy.deepcopy(stateList1)) or \
                        __exist(board, (newX, newY), (0, -1), word[1:], copy.deepcopy(stateList1)):
                    return True
                else:
                    return False
            else:
                return False

        for i in range(lenY):
            for j in range(lenX):
                if board[i][j] == word[0]:
                    stateList1 = copy.deepcopy(stateList)
                    stateList1[i][j] = True
                    if __exist(board, (j, i), (1, 0), word[1:], copy.deepcopy(stateList1)) or \
                            __exist(board, (j, i), (-1, 0), word[1:], copy.deepcopy(stateList1)) or \
                            __exist(board, (j, i), (0, 1), word[1:], copy.deepcopy(stateList1)) or \
                            __exist(board, (j, i), (0, -1), word[1:], copy.deepcopy(stateList1)):
                        return True

        return False


"""
from typing import List


class Solution:
    #         (x-1,y)
    # (x,y-1) (x,y) (x,y+1)
    #         (x+1,y)

    directions = [(0, -1), (-1, 0), (0, 1), (1, 0)]

    def exist(self, board: List[List[str]], word: str) -> bool:
        m = len(board)
        if m == 0:
            return False
        n = len(board[0])

        marked = [[False for _ in range(n)] for _ in range(m)]
        for i in range(m):
            for j in range(n):
                # 对每一个格子都从头开始搜索
                if self.__search_word(board, word, 0, i, j, marked, m, n):
                    return True
        return False

    def __search_word(self, board, word, index,
                      start_x, start_y, marked, m, n):
        # 先写递归终止条件
        if index == len(word) - 1:
            return board[start_x][start_y] == word[index]

        # 中间匹配了，再继续搜索
        if board[start_x][start_y] == word[index]:
            # 先占住这个位置，搜索不成功的话，要释放掉
            marked[start_x][start_y] = True
            for direction in self.directions:
                new_x = start_x + direction[0]
                new_y = start_y + direction[1]
                # 注意：如果这一次 search word 成功的话，就返回
                if 0 <= new_x < m and 0 <= new_y < n and \
                        not marked[new_x][new_y] and \
                        self.__search_word(board, word,
                                           index + 1,
                                           new_x, new_y,
                                           marked, m, n):
                    return True
            marked[start_x][start_y] = False
        return False


board = [["a","k","k","g","q","v","y","c","l","q","g","q","o","c","e","c","l","i","l","p","p","h","t","x","i","l","z","n","g","j","w","i","w","j","o","o","e","p","s","s","h","y","i","x","a","m","z","n","w","n","f","m","u"],["y","l","c","k","k","r","s","w","o","c","u","z","t","i","d","i","c","v","p","c","d","n","f","s","o","s","q","b","x","c","v","y","o","y","i","a","r","a","y","f","c","u","g","v","c","k","f","g","h","v","j","n","i"],["o","f","w","i","v","a","g","a","v","g","q","v","o","s","n","q","t","u","u","n","b","s","s","n","x","y","u","s","h","h","c","x","o","b","g","m","b","o","o","w","u","g","u","k","a","h","a","t","d","u","h","e","m"],["b","t","m","z","o","g","j","x","j","g","o","k","o","c","l","c","q","j","w","w","f","g","w","m","i","s","q","f","b","w","t","c","q","f","d","g","m","o","f","v","x","v","h","l","x","u","o","n","d","m","l","j","v"],["k","x","d","e","p","i","f","o","c","j","g","j","m","o","v","d","t","s","a","p","z","l","m","t","b","c","z","q","p","k","l","b","j","o","f","z","z","k","p","d","t","v","m","i","j","i","n","e","a","n","v","a","a"],["k","v","c","o","u","s","d","g","f","f","q","t","k","r","u","x","g","x","s","b","k","c","m","u","p","s","w","c","o","w","f","a","u","h","o","q","b","r","x","g","y","n","b","l","g","w","i","m","v","c","p","h","f"],["b","b","w","v","y","b","l","w","g","l","s","n","z","j","q","t","i","w","r","x","z","c","d","x","m","p","t","r","e","a","y","h","e","u","c","e","v","q","a","b","b","t","q","b","e","i","u","m","e","n","j","g","s"],["m","d","e","d","w","x","j","z","v","q","d","q","u","h","n","k","j","p","m","e","h","p","i","q","l","w","w","y","h","c","q","v","g","x","y","e","u","h","d","s","z","i","i","u","r","v","g","d","m","u","h","w","j"],["s","m","u","o","k","v","y","p","n","t","v","m","s","b","h","b","f","b","b","p","j","x","h","g","d","k","v","y","t","r","j","n","f","g","c","p","b","c","e","o","v","b","b","p","d","k","r","k","l","u","z","w","r"],["i","c","w","u","x","w","q","q","g","d","v","m","h","n","p","j","r","f","f","v","g","u","y","s","n","k","f","j","j","d","a","u","i","z","o","h","x","e","y","d","k","t","r","r","i","g","b","c","m","g","x","u","c"],["x","p","s","h","w","b","s","a","e","o","i","d","f","p","a","l","p","g","v","l","z","n","t","i","o","v","w","w","u","q","a","r","h","s","a","e","u","v","g","y","l","o","d","q","f","f","c","v","n","x","g","n","m"],["z","v","a","x","r","y","r","j","z","l","t","r","n","z","n","i","f","l","u","v","q","m","a","w","o","x","j","o","d","y","a","f","v","d","c","o","b","v","a","a","g","t","u","u","s","h","e","x","t","a","u","j","n"],["u","h","d","u","t","r","x","r","u","e","n","x","g","d","a","e","d","b","k","w","x","g","q","e","n","n","z","n","j","l","c","e","s","i","y","l","b","x","f","v","c","u","u","k","x","v","q","d","y","b","z","v","j"],["q","b","y","f","b","o","p","m","q","v","g","y","v","u","c","u","z","x","w","v","u","j","u","p","z","x","p","c","x","m","o","p","n","m","w","q","a","l","c","t","i","l","t","f","f","v","a","g","v","w","b","p","h"],["v","g","j","v","x","n","s","j","b","j","y","q","f","p","s","t","t","l","d","g","h","j","l","c","j","r","x","h","u","o","r","s","u","a","n","r","p","h","c","r","q","b","j","x","s","b","s","n","n","y","u","u","h"],["h","y","s","b","y","z","v","m","s","n","h","s","a","a","i","j","d","b","b","g","k","z","a","n","t","p","a","r","l","w","a","v","x","s","w","v","s","r","j","m","h","s","f","j","t","p","t","y","s","u","g","e","v"],["i","r","p","z","u","i","l","q","j","i","p","b","e","m","v","x","w","i","e","o","p","o","h","g","h","h","y","d","n","c","z","x","t","q","x","n","y","k","g","h","s","v","l","y","i","g","v","e","q","a","s","f","o"],["c","l","x","l","l","a","b","n","b","y","h","r","x","w","q","h","c","z","b","a","k","z","k","t","v","o","l","x","i","r","n","m","e","k","y","s","m","z","f","o","z","o","h","x","l","z","g","p","b","i","r","l","j"],["b","g","g","r","s","d","a","l","q","o","r","a","o","j","p","p","r","f","p","f","m","o","s","o","u","k","p","e","b","c","o","d","j","u","u","d","a","w","q","q","n","j","t","b","v","i","r","m","p","i","t","d","w"],["m","r","q","y","g","v","z","j","l","e","u","h","b","z","h","z","r","y","m","a","t","o","v","d","h","j","s","p","d","v","l","r","n","d","p","v","a","q","e","n","x","a","v","a","b","e","z","s","c","m","t","x","c"],["q","a","l","a","s","a","f","q","n","w","f","q","n","a","t","d","h","g","c","j","b","c","l","g","c","d","k","q","y","i","u","p","i","f","r","d","f","w","t","u","s","a","k","h","a","d","k","h","m","p","r","n","r"],["e","v","v","h","g","n","g","q","h","x","a","m","o","f","t","m","a","n","g","a","a","n","b","f","x","k","r","o","d","h","g","h","c","d","r","k","r","x","c","y","u","d","n","k","k","i","w","l","y","c","l","a","p"],["o","f","o","b","z","d","e","i","l","o","m","q","f","z","h","c","b","i","y","g","x","k","r","f","g","c","d","k","p","d","b","e","l","p","f","m","u","l","u","h","z","i","a","g","h","j","k","l","r","i","r","q","u"],["k","w","a","o","b","m","e","h","n","k","s","f","r","g","b","c","c","l","e","k","l","k","u","u","x","f","o","h","w","e","c","h","c","e","x","g","r","b","n","e","l","h","l","c","n","n","h","p","y","n","b","l","x"],["v","f","u","a","v","e","z","a","g","i","e","k","f","k","b","h","x","i","u","g","t","z","t","i","g","k","g","t","m","r","s","j","z","p","k","u","t","j","w","z","r","b","l","y","n","n","f","n","x","c","t","s","b"],["p","b","j","z","j","e","n","d","y","x","c","n","j","y","i","s","v","j","l","y","v","j","n","k","r","a","h","t","w","z","w","l","c","f","m","m","l","a","p","j","z","r","x","i","r","h","a","o","r","n","m","o","y"],["c","y","p","e","h","k","a","i","g","l","l","n","a","x","y","a","m","i","z","f","h","h","w","o","j","l","h","y","z","v","y","b","v","q","i","c","a","i","l","j","w","w","y","w","v","z","y","h","j","x","o","q","g"],["k","g","r","x","q","r","x","l","p","a","h","f","i","l","g","t","y","r","p","w","r","n","r","q","l","a","z","i","o","r","q","b","y","j","y","o","a","x","b","p","a","k","x","k","y","f","d","w","w","u","t","n","h"],["m","g","s","n","f","c","b","x","s","e","x","d","d","l","d","a","o","v","c","z","s","n","x","x","q","v","v","n","o","k","u","d","q","n","q","w","p","t","v","k","y","s","n","d","f","t","d","t","q","i","u","i","v"],["t","h","n","p","c","a","f","o","x","i","f","k","a","d","b","w","y","n","u","q","b","x","v","w","c","q","m","k","l","w","h","g","d","x","x","h","x","d","x","w","n","c","g","q","h","k","m","f","x","g","x","a","f"],["u","w","h","n","k","u","a","g","d","g","l","a","e","u","a","j","s","w","y","w","d","q","g","p","c","n","m","k","l","n","p","h","l","z","w","w","v","w","e","y","f","s","z","j","m","z","u","g","v","u","f","a","l"],["l","p","p","y","e","a","l","r","r","v","e","s","r","a","n","q","h","o","v","z","n","g","n","o","c","w","l","w","d","o","j","q","f","z","q","j","z","c","c","q","z","h","j","s","j","y","i","q","m","f","r","b","l"],["h","r","n","d","d","m","g","t","v","w","y","u","m","i","v","q","k","o","r","r","x","m","d","x","w","t","m","c","n","n","n","u","f","d","x","k","r","f","d","m","d","b","j","r","l","e","k","y","s","d","r","r","p"],["u","p","m","q","b","o","d","q","d","x","x","i","w","h","z","d","m","m","g","q","x","z","d","b","j","b","u","n","t","n","c","n","e","q","d","h","e","g","y","k","f","v","s","b","f","u","e","t","g","m","l","f","m"],["p","g","x","q","c","k","j","q","p","z","w","h","c","e","o","l","c","y","q","z","s","u","g","m","y","a","u","l","l","z","z","c","i","w","t","k","j","e","c","y","d","z","f","g","d","v","t","h","t","j","i","m","d"],["p","a","e","r","v","r","e","w","q","h","e","m","a","r","v","e","t","v","k","u","d","q","z","y","l","i","u","u","r","g","a","g","i","e","z","f","x","d","c","n","m","g","z","o","z","x","t","v","u","d","p","x","v"],["r","w","g","z","s","c","s","a","e","a","i","k","z","o","h","f","q","u","r","y","w","g","y","v","b","v","p","g","k","n","d","d","l","l","f","d","p","x","d","u","y","l","e","x","b","o","c","t","k","w","u","g","c"],["u","b","d","p","r","l","b","g","o","f","r","z","k","w","o","h","z","k","h","m","r","f","q","f","j","j","p","f","d","y","j","x","b","o","o","s","z","q","a","p","v","r","o","h","p","f","q","o","p","y","d","i","d"],["v","n","o","e","f","w","k","f","f","j","g","u","y","b","v","o","b","l","l","v","b","s","k","g","i","b","y","i","g","g","l","b","w","c","f","b","y","r","i","f","b","o","b","b","p","x","r","t","k","c","o","l","w"],["y","u","g","z","u","p","f","c","c","g","y","e","o","b","e","h","j","k","k","a","l","l","p","k","c","i","u","g","w","i","c","x","e","l","w","y","a","e","c","e","m","b","l","c","e","p","k","o","b","u","o","p","g"],["f","z","k","q","w","r","o","g","v","l","k","g","k","k","i","q","o","p","c","p","a","f","u","r","p","k","t","j","a","i","r","h","j","c","x","h","v","o","n","q","z","z","z","l","l","j","b","a","y","e","r","a","l"],["n","s","c","x","n","n","z","x","f","h","g","j","g","o","e","u","d","w","w","f","x","h","q","h","l","s","h","p","k","i","c","x","a","e","x","n","r","y","k","y","f","s","h","o","i","n","k","o","m","g","t","j","q"],["l","s","b","e","c","s","q","k","u","n","m","y","m","b","r","l","n","q","s","f","z","i","q","p","t","e","b","z","x","m","p","i","h","q","o","j","k","e","v","e","u","h","e","i","i","w","t","x","o","o","c","n","w"],["s","e","p","y","f","r","v","u","g","g","b","z","w","m","j","d","h","q","x","q","u","h","a","s","d","x","i","r","z","y","p","u","c","f","s","i","y","q","e","e","y","f","f","w","r","r","z","a","h","w","q","d","g"],["q","y","j","n","g","a","o","e","p","k","h","w","f","r","u","x","v","b","v","c","i","r","v","z","t","v","i","r","l","o","x","b","m","g","q","s","g","g","z","y","r","i","w","w","b","t","t","w","u","q","a","e","j"],["v","e","c","q","o","u","d","c","r","g","o","y","y","j","g","e","i","g","v","q","d","r","t","w","m","r","s","c","r","w","o","m","c","q","e","r","m","j","t","g","p","k","g","n","t","o","r","b","v","p","t","a","g"],["o","w","v","f","q","z","w","m","n","k","p","g","q","i","u","z","d","a","q","n","g","d","g","v","w","j","s","l","e","s","u","s","q","r","x","g","q","v","u","g","f","l","m","x","t","g","w","x","h","m","k","p","r"],["t","m","q","e","e","b","l","w","x","d","m","o","d","u","f","a","p","l","g","a","z","f","u","f","c","t","o","q","f","g","k","a","s","a","f","x","d","q","v","b","v","k","r","a","e","y","b","t","j","j","u","k","o"],["q","s","s","l","g","l","q","o","v","r","h","x","y","g","a","q","b","d","n","l","v","o","s","t","r","l","f","c","h","r","s","z","j","l","k","s","y","b","g","t","u","n","s","s","t","s","k","x","y","x","k","t","l"],["c","o","e","o","v","g","x","n","z","x","y","m","h","q","m","k","x","h","g","m","z","a","g","r","k","f","r","i","p","m","v","s","b","a","i","y","i","f","n","j","e","m","x","o","e","j","y","b","q","h","o","p","h"],["w","j","u","d","a","c","s","n","x","m","q","z","u","q","k","c","g","t","g","u","r","u","y","c","v","a","t","c","q","k","l","o","v","f","r","y","j","j","n","j","y","f","i","s","x","u","u","d","o","d","x","h","x"],["w","l","u","y","e","y","o","r","k","c","o","r","v","o","b","e","b","k","e","i","u","x","g","p","t","j","f","w","j","o","w","f","z","s","f","g","r","t","x","d","x","n","u","u","c","x","a","f","j","f","o","g","c"],["u","x","x","d","c","u","o","q","s","t","r","k","a","x","b","t","w","g","s","k","d","m","o","a","n","t","m","s","h","u","w","b","r","t","h","v","p","v","n","j","r","e","u","r","c","x","n","y","e","h","k","j","w"],["y","l","l","s","x","f","b","r","b","d","k","w","m","f","m","h","s","x","a","x","r","s","b","r","f","b","x","o","m","g","k","m","r","v","g","r","a","i","i","d","l","v","a","x","a","o","g","t","l","h","s","f","b"],["t","w","i","u","t","w","i","z","h","v","s","e","b","j","h","l","u","k","y","p","k","v","p","a","e","k","m","n","e","r","o","z","p","w","u","i","u","e","j","d","b","b","i","f","n","p","q","h","z","p","w","m","m"],["n","m","q","a","y","f","e","r","t","e","g","r","a","q","m","g","z","p","i","d","z","n","q","o","d","z","q","u","x","c","h","m","q","z","m","r","f","t","i","a","z","r","s","b","j","e","h","l","v","p","o","v","e"],["g","l","i","f","b","c","e","f","l","q","w","l","f","n","s","y","x","s","z","o","k","a","a","q","h","l","m","z","z","j","d","h","u","n","o","w","s","s","b","d","k","z","q","p","m","i","p","k","b","o","a","n","o"],["a","e","y","n","s","x","m","d","a","v","x","q","j","t","i","d","x","n","o","w","e","f","l","o","v","x","r","l","z","f","a","c","l","y","p","f","x","e","i","z","z","f","p","l","b","z","o","a","n","e","y","r","m"],["j","h","j","i","z","u","i","e","u","k","r","u","b","w","r","f","e","t","f","l","i","q","m","i","g","o","v","n","n","o","b","y","v","k","h","u","e","p","a","b","b","r","v","c","n","p","i","t","i","p","f","s","h"],["t","a","p","i","x","e","x","n","f","v","l","p","c","f","w","t","i","x","w","z","u","b","p","j","l","k","t","a","p","m","j","l","o","y","v","m","d","s","z","i","n","m","a","s","s","y","n","c","v","k","d","r","n"],["s","d","y","d","w","a","u","k","j","h","z","h","c","l","m","u","m","x","k","z","x","c","t","x","r","x","u","d","a","l","q","t","o","o","y","n","o","u","x","x","c","w","h","g","j","t","b","y","q","n","z","p","r"],["u","m","i","r","g","m","r","s","c","m","i","t","m","v","h","h","t","h","l","r","q","r","d","j","u","b","a","h","a","r","y","u","e","j","n","m","v","e","e","x","r","p","s","f","k","a","m","f","j","z","z","z","r"],["c","k","n","d","m","x","f","e","x","b","i","g","o","w","b","u","d","b","n","s","t","t","e","v","f","m","g","h","l","h","a","p","s","n","u","e","k","z","i","i","c","s","q","s","r","s","m","u","v","a","m","q","t"],["q","m","a","c","u","h","p","c","h","e","u","x","y","a","j","z","l","t","d","d","k","v","u","e","i","q","z","i","c","p","d","v","d","d","z","y","n","p","a","w","v","u","t","w","u","d","v","f","y","b","l","i","w"],["h","m","e","a","n","o","c","d","t","x","g","x","x","g","m","o","g","i","l","c","e","h","z","j","f","g","h","g","t","q","c","d","e","j","d","s","x","f","x","r","f","d","q","e","k","e","u","s","m","f","v","s","n"],["u","b","s","a","j","a","w","b","c","z","f","l","c","z","l","j","w","e","o","c","w","u","o","a","o","g","o","u","b","h","j","x","i","b","a","t","b","w","w","f","v","e","t","z","d","e","i","c","i","x","e","e","r"],["s","g","i","a","u","c","e","b","l","b","m","o","d","h","r","b","e","w","w","k","p","x","n","v","g","r","f","f","v","l","y","p","r","g","q","m","i","u","p","v","x","d","j","b","l","a","c","r","z","b","b","q","a"],["q","m","g","i","r","l","f","d","m","v","w","s","n","k","d","h","a","y","g","d","k","j","q","m","m","h","l","p","k","e","p","b","q","y","l","j","l","q","o","x","l","l","q","y","v","t","h","x","t","o","d","d","x"],["t","q","l","d","d","c","n","h","u","o","z","s","z","j","d","s","x","b","d","k","t","e","g","o","n","f","h","b","i","n","b","c","d","o","f","i","r","u","s","l","l","r","f","m","c","k","e","a","l","i","m","g","o"],["u","u","b","a","c","f","i","p","g","m","u","u","t","e","n","o","w","a","b","q","h","n","s","s","s","u","f","c","h","m","q","d","g","t","d","k","y","o","b","g","c","x","d","w","c","q","m","a","t","n","q","a","a"],["l","s","u","f","a","w","o","m","o","s","u","i","x","f","i","l","i","p","o","g","u","m","i","m","a","k","f","n","d","i","p","o","c","k","v","c","i","m","o","x","g","l","h","d","q","p","r","a","g","h","g","a","v"],["q","n","v","b","u","i","e","c","z","u","f","l","r","h","u","d","y","t","j","j","a","p","b","r","i","b","y","p","i","a","k","a","p","f","b","k","p","h","m","q","d","t","c","v","d","w","a","b","p","k","m","r","b"],["n","i","j","o","i","a","y","l","m","z","a","r","c","k","i","m","z","y","r","u","a","m","x","y","n","y","p","z","m","g","c","z","r","l","q","b","n","q","m","z","r","p","s","w","b","a","k","c","a","b","x","d","q"],["u","b","f","v","t","e","h","z","i","h","s","t","z","w","i","p","i","h","j","z","b","f","b","d","p","d","d","q","a","i","i","x","m","n","s","f","r","z","g","z","g","z","u","h","v","e","x","f","l","g","h","o","n"],["k","r","c","p","x","u","s","f","d","p","r","q","h","w","k","g","d","l","p","e","i","w","b","m","v","i","a","d","p","o","q","z","g","u","p","d","r","h","k","u","w","c","m","f","y","w","n","d","k","c","h","s","b"],["k","e","y","t","e","c","i","t","u","k","b","r","b","g","i","k","q","c","g","s","q","n","t","p","a","w","z","f","g","r","g","q","v","e","l","c","i","w","x","f","g","y","w","j","g","e","t","y","i","b","r","y","o"],["m","p","o","k","o","t","q","f","b","j","d","i","w","h","q","s","e","v","a","e","r","j","m","x","c","k","f","d","b","g","r","p","v","i","a","k","d","s","r","f","d","w","n","a","d","f","s","j","d","t","p","w","c"],["b","u","f","m","z","k","p","h","c","f","d","m","h","p","p","z","i","w","d","f","l","d","k","t","x","w","w","q","l","s","v","n","m","c","z","o","m","q","x","q","v","a","c","c","r","u","e","a","q","j","h","e","o"],["t","x","l","p","t","e","d","n","z","q","c","b","r","q","p","h","n","g","f","q","i","j","h","c","n","j","v","w","s","b","k","m","y","y","d","t","c","g","i","d","y","k","g","p","c","v","z","s","b","e","k","m","n"],["t","q","d","d","l","b","x","o","m","j","o","m","p","j","q","v","s","t","w","e","z","n","h","w","m","b","y","s","l","k","i","e","a","l","j","o","m","h","e","a","s","t","o","h","c","e","f","w","x","b","b","y","o"],["k","v","d","l","v","v","y","h","f","e","j","q","o","z","f","x","e","h","r","x","w","b","b","a","g","y","a","j","z","y","z","j","v","c","w","s","a","u","z","f","y","j","y","o","i","f","l","o","m","f","l","k","g"],["n","n","o","n","n","z","m","n","y","x","l","d","t","d","d","n","d","k","n","o","k","c","w","p","p","n","e","u","y","o","c","n","b","q","a","q","p","o","g","q","n","r","t","g","u","y","v","z","i","l","n","t","n"],["m","k","e","z","o","b","z","f","d","n","i","w","p","z","n","g","f","d","v","w","y","c","s","w","z","s","h","m","h","c","b","t","m","g","s","d","h","u","i","m","j","q","i","a","p","y","g","w","d","c","u","c","g"],["p","a","h","h","j","w","o","l","x","k","a","d","e","d","m","y","l","z","h","d","j","i","v","h","q","r","n","u","o","p","c","d","r","m","m","b","i","c","o","f","m","q","l","r","t","x","r","g","w","b","m","i","l"],["h","p","b","y","e","y","o","t","c","r","n","o","d","q","w","g","g","e","u","x","p","n","s","m","f","b","l","g","n","t","t","u","k","w","u","p","u","j","k","x","c","z","l","g","p","k","o","w","o","k","v","d","y"],["n","r","f","o","c","n","b","x","g","v","i","c","q","z","x","b","l","w","d","l","j","l","a","t","z","y","j","m","t","o","k","h","i","p","x","k","c","z","k","k","w","u","m","o","t","l","r","e","h","v","p","r","g"],["s","m","i","q","y","u","k","m","g","t","u","v","s","h","z","r","r","j","q","n","v","g","g","j","y","m","q","t","e","j","b","w","y","j","o","w","f","a","k","l","t","f","i","m","o","h","f","h","s","x","u","q","e"],["a","z","e","o","r","x","s","b","a","q","z","k","f","x","r","f","h","d","b","o","l","p","c","v","w","j","n","u","f","d","a","h","c","e","w","u","d","o","x","d","f","y","p","m","v","h","r","e","m","s","t","z","h"]]


print(Solution().exist(board,"ugjkaoncwsgsolilo"))